<?php

use yii\db\Migration;

class m161003_100538_feedbacks_initial_test_content extends Migration
{
    public function up()
    {
        $this->batchInsert('feedbacks', ['id', 'name', 'email', 'url', 'text', 'ip', 'agent', 'date'], [
            [1, 'Степан Батькович', 'stepan@test.com', 'http://hello.com', 'Все зроблено швидко, на високому професійному рівні.
Все зроблено на найвищому рівні!
Завдання було виконано швидко і в строк.
Завдання було виконано ВІДМІННО і в строк.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 14:05:36'],
            [2, 'Петро', 'test@test.c', 'http://site.com.ua', 'Результат мене дуже порадував, особливо якщо врахувати те, в які стислі терміни він був виконаний.
Роботи робилися з випередженням термінів, якісно, згідно з усіма вимогами.
Логічність і послідовність в роботі.
Професіонал, який любить свою роботу.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 14:15:20'],
            [3, 'Іван', 'test@test.c', NULL, 'Завдання виконано з випередженням термінів, по ходу роботи виникали зміни, всі вони приймалися беззастережно, робота виконана грамотно і якісно.
Рекомендую всім!!!
Завжди на зв\'язку, детально відповідає на всі питання.
Рекомендую всім, кому потрібен серйозний і працьовитий працівник.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 14:18:08'],
            [4, 'Віктор Андрійович', 'v.a@name.com', NULL, 'Дуже задоволений роботою.
Швидко та якісно!
Прекрасна робота, швидко і якісно.
Робота досить об&#039;ємна, але була виконана швидко і якісно.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 14:32:32'],
            [5, 'Степан Павлович', 's.p@name.com', NULL, 'Високий рівень компетентності, порядність і ввічливість - якості, які сьогодні дуже рідко зустрінеш.
Підходом до роботи залишився задоволений.
Відмінний виконавець.
Все швидко, оперативно і якісно.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 14:48:25'],
            [6, 'Африкан Свиридович', 'a.s@name.com', NULL, 'Робота виконана, як треба.
Сподіваюся на плідну співпрацю.
Все на високому рівні, в соответствии с ТЗ і вимогам.
Терміни витримані до години.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 15:20:30'],
            [7, 'Полікарп Федорович', 'p.f@name.com', NULL, 'Завжди виконує роботу в строк.
Приємно працювати з даними виконавцем.
Все зроблено на найвищому рівні!
Завдання виконано на високому рівні і в найкоротші терміни.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 15:48:23'],
            [8, 'Андрій Михайлович', 'a.m@super.com', NULL, 'Швидко та якісно!
Відмінний виконавець з відповідальним підходом до роботи, дуже хорошим стилем, грамотністю і вмінням вникнути в тему і завдання.
Рекомендую фрілансера, як відповідального працівника і просто приємного в спілкуванні людини.
Ваш професіоналізм виконання роботи, порядність, пунктуальність дає розуміння того, що мій вибір був зроблений правильно.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 16:12:05'],
            [9, 'Олександр Олександрович', 'o.o@super.com', NULL, 'Роботою залишилися дуже задоволені.
Робота здана на день раніше.
Час завжди розподіляє точно і дотримується терміни.
Рекомендую всім!!!', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 16:57:09'],
            [10, 'Роман Васильович', 'r.v@super.com', NULL, 'Не підведе!
Рекомендую всім!!!
Співпрацею задоволений.
Сподіваюся на плідну співпрацю.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 17:00:49'],
            [11, 'Віталій', 'vitold@super.com', 'http://vitold.name', 'Приємно працювати з даними виконавцем.
Роботою залишилися дуже задоволені.
Швидко та якісно!
Рекомендую виконавця!', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 17:02:32'],
            [12, 'Дмитро Андрійович', 'd.a@mail.com', 'http://dima.com.ua', 'Мало того, що все було виконано в строк, так ще й відмінна якість!
&lt;i&gt;Роботою залишилися дуже задоволені.&lt;/i&gt;
Завжди на зв&#039;язку, детально відповідає на всі питання.
&lt;strike&gt;Професіонал, який любить свою роботу.&lt;/strike&gt;.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 18:47:28'],
            [13, 'Віктор Вікторович', 'v.v@m.com', '', 'Все швидко, оперативно і якісно.
Приємна людина в усіх відношеннях.
Не підведе!
У підсумку - відмінно виконана робота!', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 19:23:37'],
            [14, 'Наталя Петрівна', 'n.p@m.com', '', 'Робота досить об&#039;ємна, але була виконана швидко і якісно.
Сподіваюся співпрацю продовжимо ще не один рік.
Логічність і послідовність в роботі.
Проект виконаний на 5+!', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 19:28:32'],
            [15, 'Гулам Джумабайович', 'h.j@hj.com', 'http://hulam.com', 'Завдання виконано з випередженням термінів, по ходу роботи виникали зміни, всі вони приймалися беззастережно, робота виконана грамотно і якісно.
Проект виконаний на 5+!
Завдання виконано на високому рівні і в найкоротші терміни.
Завжди виконує роботу в строк.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 20:00:32'],
            [16, 'Валентина Петрівна', 'v.p@mail.com', '', 'Якість роботи теж на високому рівні.
&lt;b&gt;Завжди виконує роботу в строк.&lt;/b&gt;
Робота досить об&#039;ємна, але була виконана швидко і якісно.
Швидко та якісно!', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 20:03:08'],
            [17, 'Павло Павлович', 'pp@pp.com', '', '&lt;strong&gt;Виконано було в найкоротші терміни і дуже професійно.&lt;/strong&gt;
Сподіваюся співпрацю продовжимо ще не один рік.
Рекомендую всім!!!
До роботи підходить відповідально і акуратно.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 20:55:11'],
            [18, 'Надія Семенівна', 'ns@mail.com', '', 'Терміни витримані до години.
&lt;i&gt;Все оперативно, завжди на зв&#039;язку.&lt;/i&gt;
Будемо співпрацювати на постійній основі.
Приємно працювати з професіоналом.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-25 20:57:28'],
            [19, 'Олег Олександрович', 'oo@gmail.com', '', 'Ваш професіоналізм виконання роботи, порядність, пунктуальність дає розуміння того, що мій вибір був зроблений правильно.
&lt;strong&gt;Рекомендую всім звертатися.&lt;/strong&gt;
Відмінна робота!
Проблеми, що виникають швидко дозволили.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 11:31:37'],
            [20, 'Валерій Євгенійович', 'v.e@mail.com', '', 'Дякую за відповідальне ставлення до роботи і якісне виконання завдання.
Завдання виконано на високому рівні і в найкоротші терміни.
Рекомендую всім, кому потрібен серйозний і працьовитий працівник.
&lt;code&gt;Прекрасна робота, швидко і якісно.&lt;/code&gt;', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 11:44:36'],
            [21, 'Василина Філософівна', 'vf@mail.com', '', '&lt;strong&gt;Завдання було виконано швидко і в строк.&lt;/strong&gt;
&lt;strike&gt;Рекомендую всім, кому потрібен серйозний і працьовитий працівник.&lt;/strike&gt;
&lt;a href=&quot;&quot;&gt;Ще раз переконуюся в його професіоналізмі.&lt;/a&gt;
&lt;i&gt;Рекомендую фрілансера, як&lt;code&gt; відповідаль&lt;i&gt;ного працівника і прост&lt;/code&gt;о приємно&lt;/i&gt;го в спілкуванні людини.&lt;/i&gt;', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 13:27:34'],
            [22, 'Катерина Світланівна', 'ks@supermail.com', '', '&lt;a href=&quot;&quot;&gt;Дякую за відповідальне ставлення до роботи і якісне виконання завдання.&lt;/a&gt;
&lt;a title=&quot;&quot;&gt;Мало того, що все було виконано в строк, так ще й відмінна якість!&lt;/a&gt;
&lt;a href=&quot;&quot; title=&quot;&quot;&gt;Як завжди все за завданням і в строк.&lt;/a&gt;
&lt;a title=&quot;&quot; href=&quot;&quot;&gt;Рекомендую.&lt;/a&gt;
&lt;a&gt;Рекомендую.&lt;/a&gt;', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 13:33:31'],
            [23, 'Григорій Сковорода', 'gs@com.com', '', '&lt;a href=&quot;http://hrisha.com&quot; title=&quot;supertitle&quot;&gt;Терміни витримані до години.&lt;/a&gt;
&lt;a title=&quot;secondtitle&quot; href=&quot;http://hrisha2.com&quot;&gt;У підсумку - відмінно виконана робота!&lt;/a&gt;
Рекомендую виконавця!
Все швидко, оперативно і якісно.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 13:36:05'],
            [24, 'Ліна Костенко', 'kostenko@mail.com', 'https://www.facebook.com/LinaKostenkoUkr', '&lt;strong&gt;Осінній день березами почавсь. &lt;/strong&gt;
&lt;i&gt;Різьбить печаль свої дереворити. &lt;/i&gt;
&lt;code&gt;Я думаю про тебе весь мій час. &lt;/code&gt;
&lt;strike&gt;Але про це не треба говорити. &lt;/strike&gt;', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 13:42:36'],
            [25, 'Василь Симоненко', 'v@s.com', '', 'Не дивилася ні на кого,
Йшла й не чула, напевне, ніг.
Але щастя твоє ще довго
Голубіло з очей у всіх.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 13:43:35'],
            [26, 'Василь Стус', 'vstus@stus.com', '', 'Там за безкраєм, там, за горою -
ти на синім морозі гориш.', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/53.0.2785.116 Safari/537.36', '2016-09-26 13:44:27']
        ]);
    }






    public function down()
    {
        $this->delete('feedbacks', 'id<=26');
    }

    /*
    // Use safeUp/safeDown to run migration code within a transaction
    public function safeUp()
    {
    }

    public function safeDown()
    {
    }
    */
}
